doc/a-new-low.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Wat: A New Low in Programming Language Design</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-04 04:59:42 CEST"/>
<meta name="author" content="Manuel Simoni"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="stylesheet.css"/>
</head>
<body>
<div id="content">

<h1 class="title">Wat: A New Low in Programming Language Design</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Abstract </h2>
<div class="outline-text-2" id="text-1">


<p>
What is a dynamic programming language made of?  <i>Wat</i> is an attempt
at finding an ultra-minimalist answer to this question.  We join
Scheme's battle cry that languages should be designed not by piling
feature on top of feature, but by removing the weaknesses and
restrictions that make additional features appear necessary.  We
select three foundational features and show that they are enough to
implement the next 700 dynamic languages in userland: for control, we
use delimited continuations that are able to express all control flow
manipulations; for syntax, we use lexically-scoped fexprs that subsume
both ordinary procedures and hygienic macros; for data, we use
first-class type tags for built-in as well as user-defined types,
allowing the creation of arbitary type-checking and type-generic
programming mechanisms in userland.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Core Language </h2>
<div class="outline-text-2" id="text-2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>Basics</td><td><code>def</code>, <code>if</code>, <code>cons</code>, <code>eq?</code></td></tr>
<tr><td>Control</td><td><code>make-prompt</code>, <code>push-prompt*</code>, <code>take-sub-cont*</code>, <code>push-sub-cont*</code></td></tr>
<tr><td>Vau Calculus</td><td><code>vau</code>, <code>eval</code>, <code>wrap</code>, <code>unwrap</code>, <code>make-environment</code></td></tr>
<tr><td>Types</td><td><code>make-type</code>, <code>type-environment</code>, <code>type-of</code>, <code>tag</code>, <code>untag</code></td></tr>
<tr><td>Constants</td><td><code>#t</code>, <code>#f</code>, <code>#void</code>, <code>#ign</code></td></tr>
</tbody>
</table>

</div>
</div>
<div id="postamble">
<p class="author"> Author: Manuel Simoni
<a href="mailto:msimoni@gmail.com">&lt;msimoni@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2012-08-04 04:59:42 CEST</p>
</div>
</div>
</body>
</html>
